//ДЗ:
//        1. Объявить переменную типа данных String, название которой состоит из нескольких слов
//        2. Создать константу “NUM” типа данных int и задать ей любое значение
//        3. Создать переменную “word” типа данных String с любым значением
//        4. Задать значение переменной объявленной в самом начале,
//        которое состояло бы из результата конкатенации константы “NUM”  и переменной “word”.
//        5. Вывести на экран значение всех переменных в одну строку
//        6. Добавить только 1 условную конструкцию, которая бы выводила на экран
//        следующее: если значение константы “NUM” меньше нуля - “Вы сохранили отрицательное число”,
//        если же значение больше нуля - “Вы сохранили положительное число”, иначе - “Вы сохранили ноль”
//        ДЗ на сообразительность:
//        7. Сделать так, чтобы программа выводила в консоль строку “Введите ваше имя:”
//        8. Затем считывала имя пользователя, введенное с клавиатуры
//        9. И в конце здоровалась с пользователем по имени которое вы ввели с клавиатуры
public class Main {
    public static void main(String[] args) {
        String myPhoneColor = " Цвет моего телефона ";

        final int NUM = 1;

        String word = "black";
        System.out.println(myPhoneColor + word + " " + NUM);

        System.out.println(myPhoneColor + NUM + " " + word);

        if (NUM > 0){
            System.out.println("Вы сохранили положительное число");
            if (NUM < 0){
                System.out.println("Вы сохранили отрицательное число");
            } else {
                System.out.println("Вы сохранили ноль");
            }
        }
    }
}